import React from 'react';

const Book = () => {
  const book = {
    title: 'Тіні забутих предків',
    author: 'Михайло Коцюбинський',
    genre: 'Роман',
    pages: 160,
    reviews: [
      'Глибокий і зворушливий роман про життя та традиції гуцулів.',
      'Неймовірно колоритний і атмосферний, справжній шедевр української літератури.',
      'Чудова робота, яка переносить читача у світ гуцульських легенд і вірувань.',
      'Це книга, яку потрібно прочитати, щоб зрозуміти душу українського народу.',
      'Відзначається вражаючим стилем і проникливістю в зображенні людських почуттів і звичаїв.'
    ]
  };

  return (
    <div>
      <h1>{book.title}</h1>
      <h2>Автор: {book.author}</h2>
      <p>Жанр: {book.genre}</p>
      <p>Кількість сторінок: {book.pages}</p>
      <h3>Рецензії:</h3>
      <ul>
        {book.reviews.map((review, index) => (
          <li key={index}>{review}</li>
        ))}
      </ul>
    </div>
  );
};

export default Book;
